zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_btimer.h
/** @addtogroup BTIMER_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt Mask. If a bit is set, then
                                                      corresponding interrupt is un-masked. Un-masking the interrupt
                                                      causes the raw interrupt to be visible in IIDX, as well as MIS. */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw interrupt status. Reflects all pending
                                                      interrupts, regardless of masking. The RIS register allows the user
                                                      to implement a poll scheme. A flag set in this register can be
                                                      cleared by writing 1 to the ICLR register bit even if the
                                                      corresponding IMASK bit is not enabled. */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked interrupt status. This is an AND of the
                                                      IMASK and RIS registers. */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt set. Allows interrupts to be set by
                                                      software (useful in diagnostics and safety checks). Writing a 1 to
                                                      a bit in ISET will set the event and therefore the related RIS bit
                                                      also gets set. If the interrupt is enabled through the mask, then
                                                      the corresponding MIS bit is also set. */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear. Write a 1 to clear corresponding
                                                      Interrupt. */
} BTIMER_CPU_INT_Regs;

/*@}*/ /* end of group BTIMER_CPU_INT */

/** @addtogroup BTIMER_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) Reset Control */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) Status Register */
} BTIMER_GPRCM_Regs;

/*@}*/ /* end of group BTIMER_GPRCM */

/** @addtogroup BTIMER
  @{
*/

typedef struct {
       uint32_t RESERVED0[256];
  __IO uint32_t FSUB_0;                            /* !< (@ 0x00000400) Subscriber Configuration Register. */
       uint32_t RESERVED1[16];
  __IO uint32_t FPUB_0;                            /* !< (@ 0x00000444) Publisher Port 0 */
       uint32_t RESERVED2[238];
  BTIMER_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) */
       uint32_t RESERVED3[512];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00001018) Peripheral Debug Control */
       uint32_t RESERVED4;
  BTIMER_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED5;
  BTIMER_GEN_EVENT_Regs  GEN_EVENT;                         /* !< (@ 0x00001050) */
       uint32_t RESERVED6[25];
  __I  uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) Event Mode */
       uint32_t RESERVED7[7];
  BTIMER_CTRREGS_Regs  CTRREGS[2];                        /* !< (@ 0x00001100) */
} BTIMER_Regs;

/*@}*/ /* end of group BTIMER */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* BTIMER Register Control Bits - 基本定时器寄存器位域定义
* 包含：计数器控制(使能/启动/停止/复位/时钟)、周期值、中断状态/屏蔽位域
******************************************************************************/

/* BTIMER_CTL0 Bits - 计数器控制寄存器 */
/* BTIMER_CTL0[EN] Bits - 计数器使能 */
#define BTIMER_CTL0_EN_OFS                       (0)                             /* !< EN Offset */
#define BTIMER_CTL0_EN_MASK                      ((uint32_t)0x00000001U)         /* !< Counter Enable */
/* BTIMER_CTL0[STARTSEL] Bits - 计数器启动事件源选择 */
#define BTIMER_CTL0_STARTSEL_OFS                 (4)                             /* !< STARTSEL Offset */
#define BTIMER_CTL0_STARTSEL_MASK                ((uint32_t)0x000000F0U)         /* !< Selects the source used to start
                                                                                    the counter. */
/* BTIMER_CTL0[STOPSEL] Bits - 计数器停止事件源选择 */
#define BTIMER_CTL0_STOPSEL_OFS                  (8)                             /* !< STOPSEL Offset */
#define BTIMER_CTL0_STOPSEL_MASK                 ((uint32_t)0x00000F00U)         /* !< Selects the source used to stop the
                                                                                    counter. */
/* BTIMER_CTL0[RESETSEL] Bits - 计数器复位事件源选择 */
#define BTIMER_CTL0_RESETSEL_OFS                 (12)                            /* !< RESETSEL Offset */
#define BTIMER_CTL0_RESETSEL_MASK                ((uint32_t)0x0000F000U)         /* !< Selects the source used to reset
                                                                                    the counter. */
/* BTIMER_CTL0[CLKSEL] Bits - 计数器时钟源选择 */
#define BTIMER_CTL0_CLKSEL_OFS                   (16)                            /* !< CLKSEL Offset */
#define BTIMER_CTL0_CLKSEL_MASK                  ((uint32_t)0x000F0000U)         /* !< Clock sources */

/* BTIMER_LD Bits */
/* BTIMER_LD[VAL] Bits */
#define BTIMER_LD_VAL_OFS                        (0)                             /* !< VAL Offset */
#define BTIMER_LD_VAL_MASK                       ((uint32_t)0x0000FFFFU)         /* !< Period value */
#define BTIMER_LD_VAL_MINIMUM                    ((uint32_t)0x00000001U)         /* !< Minimum counter value */
#define BTIMER_LD_VAL_MAXIMUM                    ((uint32_t)0x0000FFFFU)         /* !< Maximum counter value */

