zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_btimer.h
/* BTIMER_PWREN Bits */
/* BTIMER_PWREN[ENABLE] Bits */
#define BTIMER_PWREN_ENABLE_OFS                  (0)                             /* !< ENABLE Offset */
#define BTIMER_PWREN_ENABLE_MASK                 ((uint32_t)0x00000001U)         /* !< Enable the power */
#define BTIMER_PWREN_ENABLE_DISABLE              ((uint32_t)0x00000000U)         /* !< Disable Power */
#define BTIMER_PWREN_ENABLE_ENABLE               ((uint32_t)0x00000001U)         /* !< Enable Power */
/* BTIMER_PWREN[KEY] Bits */
#define BTIMER_PWREN_KEY_OFS                     (24)                            /* !< KEY Offset */
#define BTIMER_PWREN_KEY_MASK                    ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define BTIMER_PWREN_KEY_UNLOCK_W                ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* BTIMER_RSTCTL Bits */
/* BTIMER_RSTCTL[RESETSTKYCLR] Bits */
#define BTIMER_RSTCTL_RESETSTKYCLR_OFS           (1)                             /* !< RESETSTKYCLR Offset */
#define BTIMER_RSTCTL_RESETSTKYCLR_MASK          ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define BTIMER_RSTCTL_RESETSTKYCLR_NOP           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define BTIMER_RSTCTL_RESETSTKYCLR_CLR           ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* BTIMER_RSTCTL[RESETASSERT] Bits */
#define BTIMER_RSTCTL_RESETASSERT_OFS            (0)                             /* !< RESETASSERT Offset */
#define BTIMER_RSTCTL_RESETASSERT_MASK           ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define BTIMER_RSTCTL_RESETASSERT_NOP            ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define BTIMER_RSTCTL_RESETASSERT_ASSERT         ((uint32_t)0x00000001U)         /* !< Assert reset */
/* BTIMER_RSTCTL[KEY] Bits */
#define BTIMER_RSTCTL_KEY_OFS                    (24)                            /* !< KEY Offset */
#define BTIMER_RSTCTL_KEY_MASK                   ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define BTIMER_RSTCTL_KEY_UNLOCK_W               ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* BTIMER_STAT Bits */
/* BTIMER_STAT[RESETSTKY] Bits */
#define BTIMER_STAT_RESETSTKY_OFS                (16)                            /* !< RESETSTKY Offset */
#define BTIMER_STAT_RESETSTKY_MASK               ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define BTIMER_STAT_RESETSTKY_NORES              ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define BTIMER_STAT_RESETSTKY_RESET              ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* BTIMER_FSUB_0 Bits */
/* BTIMER_FSUB_0[CHANID] Bits */
#define BTIMER_FSUB_0_CHANID_OFS                 (0)                             /* !< CHANID Offset */
#define BTIMER_FSUB_0_CHANID_MASK                ((uint32_t)0x000000FFU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define BTIMER_FSUB_0_CHANID_MNIMUM              ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define BTIMER_FSUB_0_CHANID_UNCONNECTED         ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define BTIMER_FSUB_0_CHANID_MAXIMUM             ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 255. */

/* BTIMER_FPUB_0 Bits */
/* BTIMER_FPUB_0[CHANID] Bits */
#define BTIMER_FPUB_0_CHANID_OFS                 (0)                             /* !< CHANID Offset */
#define BTIMER_FPUB_0_CHANID_MASK                ((uint32_t)0x000000FFU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define BTIMER_FPUB_0_CHANID_MNIMUM              ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define BTIMER_FPUB_0_CHANID_UNCONNECTED         ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define BTIMER_FPUB_0_CHANID_MAXIMUM             ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

