zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_btimer.h
/* BTIMER_PDBGCTL Bits */
/* BTIMER_PDBGCTL[FREE] Bits */
#define BTIMER_PDBGCTL_FREE_OFS                  (0)                             /* !< FREE Offset */
#define BTIMER_PDBGCTL_FREE_MASK                 ((uint32_t)0x00000001U)         /* !< Free run control */
#define BTIMER_PDBGCTL_FREE_STOP                 ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define BTIMER_PDBGCTL_FREE_RUN                  ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* BTIMER_PDBGCTL[SOFT] Bits */
#define BTIMER_PDBGCTL_SOFT_OFS                  (1)                             /* !< SOFT Offset */
#define BTIMER_PDBGCTL_SOFT_MASK                 ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define BTIMER_PDBGCTL_SOFT_IMMEDIATE            ((uint32_t)0x00000000U)         /* !< The peripheral will halt
                                                                                    immediately, even if the resultant
                                                                                    state will result in corruption if
                                                                                    the system is restarted */
#define BTIMER_PDBGCTL_SOFT_DELAYED              ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

/* BTIMER_EVT_MODE Bits */
/* BTIMER_EVT_MODE[CPU_INT_CFG] Bits */
#define BTIMER_EVT_MODE_CPU_INT_CFG_OFS          (0)                             /* !< CPU_INT_CFG Offset */
#define BTIMER_EVT_MODE_CPU_INT_CFG_MASK         ((uint32_t)0x00000003U)         /* !< Event line mode select for event
                                                                                    corresponding to CPU_INT */
#define BTIMER_EVT_MODE_CPU_INT_CFG_DISABLE      ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define BTIMER_EVT_MODE_CPU_INT_CFG_SOFTWARE     ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define BTIMER_EVT_MODE_CPU_INT_CFG_HARDWARE     ((uint32_t)0x00000002U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */
/* BTIMER_EVT_MODE[GEN_EVENT_CFG] Bits */
#define BTIMER_EVT_MODE_GEN_EVENT_CFG_OFS        (2)                             /* !< GEN_EVENT_CFG Offset */
#define BTIMER_EVT_MODE_GEN_EVENT_CFG_MASK       ((uint32_t)0x0000000CU)         /* !< Event line mode select for event
                                                                                    corresponding to CPU_INT */
#define BTIMER_EVT_MODE_GEN_EVENT_CFG_DISABLE    ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define BTIMER_EVT_MODE_GEN_EVENT_CFG_SOFTWARE   ((uint32_t)0x00000004U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define BTIMER_EVT_MODE_GEN_EVENT_CFG_HARDWARE   ((uint32_t)0x00000008U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_btimer__include */

